alpha3/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 5.023350;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value $internalField;

    }

    outlet
    {
        type            zeroGradient;
    }

 
    airfoil
    {
        type            kqRWallFunction;
         value $internalField;

    }


    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
